<template>
  <div class="container mt--300">
    <card>
      <template v-slot:header>
        <h2>区块链是信任链，也是数据链</h2>
      </template>
      <div class="title">
      <h2>{{title}}</h2>
    </div>
    <div class="content">
      <p>这两天，有一个东西的热度，可以说用“炸裂”来形容并不过分，这个东西就是“区块链”。</p>
      <img src="http://home.gsdata.cn/d/file/news-report/research-report/2019-10-29/b61bdcd59649e139bd681acf3d3178bb.jpg" alt="" class="article-images">
      <p>其实，很早之前随着比特币的火热，“区块链”这个名词就开始被一部分人所熟知。只是由于其原理通常都被解释得较为书面化、晦涩难懂，所以大部分人只是一知半解，热度也比较低。<br>
        但是，为什么它突然又火起来了呢？源于10月25日，中央组织了一次对区块链技术发展现状和趋势的集体学习。在这次学习中，“区块链”被公开点名，要求大力发展。于是，这个重大政策利好的释放，让区块链再次成为热议的话题。<br>
        那么，什么是“区块链”？发展“区块链”对个人和行业发展来说，到底意味着什么呢？</p>
        <p>什么是“区块链”？

 

      一句话解释，对于个人来讲，区块链就是“信任链”。

      

      为什么这么说？因为区块链的产生之初，是为了解决一个信任问题。

      

      自古以来，人跟人交往，都有一个信任问题。两个陌生人面对面，你不相信我，我不相信你，怎么办？聪明的人想出了一个办法——找一个靠谱的中间人。有了这个大家都相信的靠谱中间人，大家就可以安心交易了。于是，信任危机解除了。

      

      这个中间人，发展到现代社会，就是连接双十一购物卖家和买家的某宝，连接存款人与借贷人的银行。

      

      但是，这中间有个问题。如果这个中间人“不靠谱”怎么办？

      

      以上面的例子来说，我想可能不止一个人思考过一个问题：“哪天，银行突然倒闭了怎么办？”虽然在现实生活中，银行倒闭的事情是极少发生的，但还是有这种可能。那如何解决这个问题呢？

      

      区块链诞生了。通俗地讲，有人发明了一种名为“区块链”的技术，来替代了中间人的作用。

      

      那凭什么区块链能成为中间人呢？这就要讲到区块链的一个特点：去中心化。

      

      什么是去中心化？简单来讲，两个陌生人交易，需要找一个中间人，那么这个中间人就是两个陌生人交易的中心。如果去掉了这个中心，那两个就交易不成功了。

      

      区块链技术如何去掉这个中心，同时又保证交易成功的呢？

      

      两个陌生人做交易，互相不信任，但是没有中间人怎么办？区块链技术用了一个方法，就是两个人同时记一笔账。光记了账可不行，还要广播，向全世界的人喊一遍，“我们做交易啦！大家快来看啊！”然后全世界的人，也跟着都记下了这笔交易。

      

      用学术的语言解释就是：区块链是分布式数据存储、点对点传输、共识机制、加密算法等计算机技术的新型应用模式。

      

      区块链去掉了传统的中心，让每一个人都成了中心，建立了一个全世界共享的“账本”，从此解决了信任问题。

      

      所以说，区块链是“信任链”。</p>
      </div>
    </card>
  </div>
</template>
<script>
import Card from '../../components/Card'
export default {
  components: {
    Card
  },
  props: {
    title: {
      type: String,
      description: 'The title of the article'
    },
    brief: String,
    content: String,
    date: Date,
    images: [Object],
    cover: String
  }
}
</script>
<style scoped>
.article-images {
  max-width: 90%;
  margin: 0 auto;
}
</style>